%   Нечёткая аппроксимация зависимости:
%==========================================================================
close all

n = 15;         % количество точек дискретизации

% % ********************************* Var_2 ***

x1 = linspace(0, 2, n);
x2 = linspace(0, 2, n);

y = zeros(n, n);
for i = 1:n
    y(i,:) = x1.*sin(4*x1)+1.1*x2(i)*sin(2*x2(i));   
end    
% %---------------------------------------------
h1 = figure(1);
set(h1,'Position',[3   49   330   260])
surf(x1, x2, y)
axis([min(x1)  max(x1) ...
      min(x2)  max(x2)  ...
      min(min(y))  max(max(y)) ]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Var 2') 

%--------------------------------------------------------------------------
% Построение графика нечёткого отображения Мамдани
% с треугольными функциями принадл. термов вх.перем.
%---------------------------------------------

fM = readfis('firstM');        % загрузка нечёткой системы с диска

yM = zeros(n, n);
for i = 1:n
    yM(i,:) = evalfis([x1; ones(size(x1))*x2(i)], fM)';    
end

%---------------------------------------------

h2 = figure(2);
set(h2,'Position',[5    65   524   407])
surf(x1, x2, yM)
axis([0  2 ...
      0  2 ...
      -5  25]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Система нечёткого вывода Мамдани (треуг.функ.прин.) - firstM.fis')

%--------------------------------------------------------------------------
% Построение графика нечёткого отображения Мамдани
% с гауссовыми функциями принадл. термов вх.перем.
%---------------------------------------------

fMg = readfis('firstMg');       % загрузка нечёткой системы с диска

yMg = zeros(n, n);
for i = 1:n
    yMg(i,:) = evalfis([x1; ones(size(x1))*x2(i)], fMg)';    
end  

%---------------------------------------------

h3 = figure(3);
set(h3,'Position',[536    65   524   407])
surf(x1, x2, yMg)
axis([0  2 ...
      0  2 ...
      -5  25 ]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Система нечёткого вывода Мамдани (гаус.функ.прин.) - firstMg.fis')

%--------------------------------------------------------------------------
% Построение графика нечёткого отображения Сугено
%---------------------------------------------

fS = readfis('firstS');       % загрузка нечёткой системы с диска

yS = zeros(n, n);
for i = 1:n
    yS(i,:) = evalfis([x1; ones(size(x1))*x2(i)], fS)';    
end  

%---------------------------------------------

h4 = figure(4);
set(h4,'Position',[1067  65  524  407])
surf(x1, x2, yS)
axis([0  2 ...
      0  2 ...
      -5   25]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Система нечёткого вывода Сугено - firstS.fis')

%--------------------------------------------------------------------------
% Вычисление среднеквадратических значений ошибки нечёткой аппроксимации
%---------------------------------------------

% FIS Мамдани с треуг.функ.прин.терм.вх.перем.

eMkv = (y-yM).^2;               % квадрат ошибки аппрокс.в узловых точках
SeMkv = sum(sum(eMkv));         % сумма квадратов ошибок по всем точкам
NeM = numel(yM);                % общее количество контрольных точек
RMSE_M = sqrt(SeMkv/NeM);       % среднеквадратичное значение ошибки

% FIS Мамдани с гаус.функ.прин.терм.вх.перем.
RMSE_Mg = sqrt(sum(sum((y-yMg).^2))/numel(yMg));	% среднекв.знач.ошибки

% FIS Сугено
RMSE_S = sqrt(sum(sum((y-yS).^2))/numel(yS));       % среднекв.знач.ошибки

%---------------------------------------------

disp(' ')
disp('Средние квадратические значения ошибки аппроксимации:')
disp([' FIS Мамдани с треуг.функ.прин.терм.вх.перем.:  RMSE = ',  num2str(RMSE_M)])
disp([' FIS Мамдани с гаусс.функ.прин.терм.вх.перем.:  RMSE = ',  num2str(RMSE_Mg)])
disp([' FIS Сугено:                                    RMSE = ',  num2str(RMSE_S)])
disp(' ')

%---------------------------------------------
figure(2);
xlabel(['x_1       RMSE = ',num2str(RMSE_M)]);

figure(3);
xlabel(['x_1       RMSE = ',num2str(RMSE_Mg)]);

figure(4);
xlabel(['x_1       RMSE = ',num2str(RMSE_S)]);
%---------------------------------------------
